In [2]:
%load_ext sql
%sql postgresql://four2qhrm:42Qhrm!1@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod

* Page 29 - Channel 테이블 만들어보기

In [8]:
%%sql

create table four2qhrm.channel (channel varchar(32) primary key);

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
Done.

[]

In [10]:
%%sql

insert into four2qhrm.channel values ('Facebook'), ('Google');

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
2 rows affected.

[]

In [12]:
%%sql
drop table four2qhrm.channel;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
Done.

[]

* Page 30 - Channel 테이블 만들어보기(CTAS 연습) <br>
1) Channel 테이블 만들어보기

In [13]:
%%sql

CREATE TABLE four2qhrm.channel AS select distinct channel FROM raw_data.user_session_channel;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
Done.

[]

In [7]:
%%sql

SELECT * FROM four2qhrm.channel

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
6 rows affected.

[('Organic',),
 ('Google',),
 ('Naver',),
 ('Facebook',),
 ('Youtube',),
 ('Instagram',)]

2) summary 테이블 생성

In [9]:
%%sql

CREATE TABLE four2qhrm.monthly_active_user_summary AS
SELECT TO_CHAR(ts, 'YYYY-MM') AS month, COUNT(DISTINCT userid) FROM raw_data.user_session_channel A
LEFT JOIN raw_data.session_timestamp B ON A.sessionid = B.sessionid
GROUP BY month
ORDER BY month DESC;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
Done.

[]

In [11]:
%%sql

SELECT * FROM four2qhrm.monthly_active_user_summary;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
7 rows affected.

[('2019-11', 721),
 ('2019-08', 662),
 ('2019-10', 763),
 ('2019-09', 639),
 ('2019-07', 623),
 ('2019-06', 459),
 ('2019-05', 281)]

### Page 31 - Channel 테이블 만들어보기 (3) 실습
* 컬럼명 변경
* 새 값 INSERT

In [50]:
%%sql

ALTER TABLE four2qhrm.channel RENAME channel to channelname;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
Done.

[]

In [53]:
%%sql

SELECT * FROM four2qhrm.channel;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
6 rows affected.

[('Naver',),
 ('Facebook',),
 ('Youtube',),
 ('Instagram',),
 ('Organic',),
 ('Google',)]

In [54]:
%%sql

INSERT INTO four2qhrm.channel VALUES('TIKTOK');

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[]

In [55]:
%%sql

SELECT * FROM four2qhrm.channel;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
7 rows affected.

[('Organic',),
 ('Google',),
 ('Naver',),
 ('Facebook',),
 ('Youtube',),
 ('Instagram',),
 ('TIKTOK',)]

* COUNT 실습

In [21]:
%%sql

SELECT COUNT(1) FROM raw_data.user_session_channel;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(101520,)]

In [19]:
%%sql

SELECT COUNT(userid) FROM raw_data.user_session_channel;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(101520,)]

In [20]:
%%sql

SELECT COUNT(DISTINCT userid) FROM raw_data.user_session_channel;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(949,)]

In [24]:
%%sql

SELECT COUNT(1) FROM raw_data.user_session_channel
WHERE channel in ('Youtube', 'Instagram');

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(33922,)]

In [ ]:
## select count(1) / count(*) : null도 카운트 
## select count('필드명') : null은 카운트 안함
# CASE WHEN을 쓰면 특정 RANGE에 따라

* LIKE VS ILIKE

In [3]:
%%sql

SELECT DISTINCT channel FROM raw_data.user_session_channel 
WHERE channel ILIKE '%o%';

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
4 rows affected.

[('Organic',), ('Google',), ('Youtube',), ('Facebook',)]

In [4]:
%%sql

SELECT DISTINCT channel FROM raw_data.user_session_channel 
WHERE channel LIKE '%o%';

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
3 rows affected.

[('Google',), ('Youtube',), ('Facebook',)]

* STRING Functions

In [12]:
%%sql

SELECT 
    LEN(channelname),
    UPPER(channelname),
    LOWER(channelname),
    LEFT(channelname, 4)
FROM four2qhrm.channel

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
7 rows affected.

[(7, 'ORGANIC', 'organic', 'Orga'),
 (6, 'GOOGLE', 'google', 'Goog'),
 (5, 'NAVER', 'naver', 'Nave'),
 (8, 'FACEBOOK', 'facebook', 'Face'),
 (7, 'YOUTUBE', 'youtube', 'Yout'),
 (9, 'INSTAGRAM', 'instagram', 'Inst'),
 (6, 'TIKTOK', 'tiktok', 'TIKT')]

* Page 39 - EXTRACT 실습 <br>
: SESSION이 가장 많이 생성되는 시간대

In [49]:
%%sql

SELECT EXTRACT(HOUR FROM ts) AS Hour,
COUNT(distinct sessionid) AS Count_session
FROM raw_data.session_timestamp 
GROUP BY 1
ORDER BY 2 DESC;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
24 rows affected.

[(15, 15339),
 (16, 14140),
 (14, 13417),
 (17, 10698),
 (13, 9035),
 (18, 7469),
 (19, 5278),
 (20, 3956),
 (12, 3852),
 (21, 3238),
 (22, 2801),
 (23, 2348),
 (0, 1870),
 (11, 1411),
 (1, 1328),
 (2, 1125),
 (10, 870),
 (3, 815),
 (4, 703),
 (5, 611),
 (6, 491),
 (9, 340),
 (7, 236),
 (8, 149)]

In [45]:
%%sql

SELECT EXTRACT(YEAR FROM CONVERT_TIMEZONE('Japan', SYSDATE)) 년,
EXTRACT(MONTH FROM CONVERT_TIMEZONE('Japan', SYSDATE)) 월,
EXTRACT(DAY FROM CONVERT_TIMEZONE('Japan', SYSDATE)) 일,
EXTRACT(HOUR FROM CONVERT_TIMEZONE('Japan', SYSDATE)) 시,
EXTRACT(MINUTE FROM CONVERT_TIMEZONE('Japan', SYSDATE)) 분;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(2021, 1, 24, 23, 48)]

* Page 44 - JOIN <br>
: 채널별 사용자수

In [30]:
%%sql

SELECT A.channel, count(distinct B.userid) FROM raw_data.channel A
LEFT JOIN raw_data.user_session_channel AS B on A.channel = B.channel GROUP BY A.channel

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
6 rows affected.

[('Instagram', 895),
 ('Naver', 882),
 ('Youtube', 889),
 ('Facebook', 889),
 ('Organic', 895),
 ('Google', 893)]

### Page 53 - 사용자별로 처음 채널과 마지막 채널 알아내기

* 마지막 사용 채널 (ROW_NUMBER() 사용)

In [50]:
%%sql

SELECT userid, channel FROM(
    SELECT a.userid, 
        a.channel, 
        b.ts,
        ROW_NUMBER() OVER(partition by a.userid order by b.ts DESC) AS row
    FROM raw_data.user_session_channel a
    LEFT JOIN raw_data.session_timestamp b on a.sessionid = b.sessionid
) WHERE userid = 251 and row = 1 ;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(251, 'Google')]

* 처음 사용 채널 (ROW_NUMBER() 사용)

In [51]:
%%sql

SELECT userid, channel FROM(
    SELECT a.userid, 
        a.channel, 
        b.ts,
        ROW_NUMBER() OVER(partition by a.userid order by b.ts) AS row
    FROM raw_data.user_session_channel a
    LEFT JOIN raw_data.session_timestamp b on a.sessionid = b.sessionid
)  WHERE userid = 251 and row = 1 ;

 * postgresql://four2qhrm:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(251, 'Facebook')]